const अर्धाक्षार  = "्"
const सूत्राणि = [
  { इक्: "ि", अच्: "अ", यण्: "य" },
  { इक्: "ु", अच्: "अ", यण्: "व" },
  { इक्: "ु", अच्: "इ", यण्: "वि" },
];
/**
 * 
 * @param {String} पूर्व_पदम् 
 * @param {String} उत्तर_पदम् 
 * @returns {String} संधिपदम्
 */
function प्रक्रिया(पूर्व_पदम्,उत्तर_पदम्){
    for(var सूत्राम् of सूत्राणि){
        if (पूर्व_पदम्.endsWith(सूत्राम्["इक्"]) && उत्तर_पदम्.startsWith(सूत्राम्["अच्"])) {
            return पूर्व_पदम्.slice(0, -1) + अर्धाक्षार + सूत्राम्["यण्"] + उत्तर_पदम्.replace(सूत्राम्["अच्"], "");
          }
    }
    return पूर्व_पदम्+" "+उत्तर_पदम्;
}
var संधिपदम् = प्रक्रिया("इति","अनुग्रः")
console.log("संधिपदम्",संधिपदम्)
संधिपदम् = प्रक्रिया("गुरु","अनुग्रः")
console.log("संधिपदम्",संधिपदम्)