const ಅರ್ಧಾಕ್ಷರ = " ್";
const ಸೂತ್ರಗಳು = [
  { ಇಕ್: "ಿ", ಅಚ್: "ಅ", ಯಣ್: "ಯ" },
  { ಇಕ್: "ು", ಅಚ್: "ಅ", ಯಣ್: "ವ" },
  { ಇಕ್: "ು", ಅಚ್: "ಇ", ಯಣ್: "ವಿ" },
];
/**
 * 
 * @param {String} ಪೂರ್ವ_ಪದ 
 * @param {String} ಉತ್ತರ_ಪದ 
 * @returns {String} ಸಂಧಿಪದ
 */
function ಪ್ರಕ್ರಿಯೆ(ಪೂರ್ವ_ಪದ,ಉತ್ತರ_ಪದ){
    for(var ಸೂತ್ರ of ಸೂತ್ರಗಳು){
        if (ಪೂರ್ವ_ಪದ.endsWith(ಸೂತ್ರ["ಇಕ್"]) && ಉತ್ತರ_ಪದ.startsWith(ಸೂತ್ರ["ಅಚ್"])) {
            return ಪೂರ್ವ_ಪದ.slice(0, -1) + ಅರ್ಧಾಕ್ಷರ + ಸೂತ್ರ["ಯಣ್"] + ಉತ್ತರ_ಪದ.replace(ಸೂತ್ರ["ಅಚ್"], "");
          }
    }
    return ಪೂರ್ವ_ಪದ+" "+ಉತ್ತರ_ಪದ;
}
var ಸಂಧಿಪದ = ಪ್ರಕ್ರಿಯೆ("ಇತಿ","ಅನುಗ್ರಹ")
console.log("ಸಂಧಿಪದ",ಸಂಧಿಪದ)
ಸಂಧಿಪದ = ಪ್ರಕ್ರಿಯೆ("ಗುರು","ಅನುಗ್ರಹ")
console.log("ಸಂಧಿಪದ",ಸಂಧಿಪದ)